Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21a1/edc/ATSAML21J18A.PIC
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4000000A"/>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="PWSAKDLY" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x4000000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="DLYVAL" edc:nzwidth="0x7" edc:desc="Delay Value"/>
            <edc:SFRFieldDef edc:cname="IGNACK" edc:nzwidth="0x1" edc:desc="Ignore Acknowledge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F3" edc:_addr="0x4000000D"/>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="---n-n--" edc:por="00000000" edc:mclr="00000000" edc:impl="0x14" edc:_addr="0x40000400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CFDEN" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMCLK" edc:nzwidth="0x1" edc:desc="Emergency Clock Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40000401">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:nzwidth="0x1" edc:desc="Clock Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CFD" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40000402">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:nzwidth="0x1" edc:desc="Clock Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CFD" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000001" edc:mclr="00000001" edc:impl="0x3" edc:_addr="0x40000403">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:nzwidth="0x1" edc:desc="Clock Ready"/>
            <edc:SFRFieldDef edc:cname="CFD" edc:nzwidth="0x1" edc:desc="Clock Failure Detector"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="CPUDIV" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000001" edc:mclr="00000001" edc:_addr="0x40000404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CPUDIV" edc:nzwidth="0x8" edc:desc="CPU Clock Division Factor">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0xFF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0xFF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide by 32" edc:when="(field &amp; 0xFF) == 0x20"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0xFF) == 0x40"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128" edc:when="(field &amp; 0xFF) == 0x80"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="LPDIV" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000001" edc:mclr="00000001" edc:_addr="0x40000405">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="LPDIV" edc:nzwidth="0x8" edc:desc="Low-Power Clock Division Factor">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0xFF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0xFF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide by 32" edc:when="(field &amp; 0xFF) == 0x20"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0xFF) == 0x40"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128" edc:when="(field &amp; 0xFF) == 0x80"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="BUPDIV" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000001" edc:mclr="00000001" edc:_addr="0x40000406">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="BUPDIV" edc:nzwidth="0x8" edc:desc="Backup Clock Division Factor">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0xFF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0xFF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide by 32" edc:when="(field &amp; 0xFF) == 0x20"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0xFF) == 0x40"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128" edc:when="(field &amp; 0xFF) == 0x80"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x9" edc:_addr="0x40000407"/>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="AHBMASK" edc:nzwidth="0x20" edc:access="------------nnnnnn-nnnnn--nnnnnn" edc:por="00000000000011111111111111111111" edc:mclr="00000000000011111111111111111111" edc:impl="0xFDF3F" edc:_addr="0x40000410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="HPB0_" edc:nzwidth="0x1" edc:desc="HPB0 AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HPB1_" edc:nzwidth="0x1" edc:desc="HPB1 AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HPB2_" edc:nzwidth="0x1" edc:desc="HPB2 AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HPB3_" edc:nzwidth="0x1" edc:desc="HPB3 AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HPB4_" edc:nzwidth="0x1" edc:desc="HPB4 AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU AHB Clock Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HSRAM_" edc:nzwidth="0x1" edc:desc="HSRAM AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="LPRAM_" edc:nzwidth="0x1" edc:desc="LPRAM AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="USB_" edc:nzwidth="0x1" edc:desc="USB AHB Clock Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_PICACHU_" edc:nzwidth="0x1" edc:desc="NVMCTRL_PICACHU AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="L2HBRIDGES_H_" edc:nzwidth="0x1" edc:desc="L2HBRIDGES_H AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="H2LBRIDGES_H_" edc:nzwidth="0x1" edc:desc="H2LBRIDGES_H AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HSRAM_AHBSETUPKEEPER_" edc:nzwidth="0x1" edc:desc="HSRAM_AHBSETUPKEEPER AHB Clock Mask"/>
            <edc:SFRFieldDef edc:cname="HSRAM_HMATRIXLP2HMCRAMCHSBRIDGE_" edc:nzwidth="0x1" edc:desc="HSRAM_HMATRIXLP2HMCRAMCHSBRIDGE AHB Clock Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="APBAMASK" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnnnnn" edc:por="00000000000000000001111111111111" edc:mclr="00000000000000000001111111111111" edc:impl="0x7FF" edc:_addr="0x40000414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="PM_" edc:nzwidth="0x1" edc:desc="PM APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:nzwidth="0x1" edc:desc="MCLK APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:nzwidth="0x1" edc:desc="RSTC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:nzwidth="0x1" edc:desc="OSCCTRL APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:nzwidth="0x1" edc:desc="OSC32KCTRL APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:nzwidth="0x1" edc:desc="SUPC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:nzwidth="0x1" edc:desc="GCLK APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:nzwidth="0x1" edc:desc="WDT APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:nzwidth="0x1" edc:desc="RTC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="APBBMASK" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:por="00000000000000000000000000000111" edc:mclr="00000000000000000000000000000111" edc:impl="0x7" edc:_addr="0x40000418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="USB_" edc:nzwidth="0x1" edc:desc="USB APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="APBCMASK" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000111111111111111" edc:mclr="00000000000000000111111111111111" edc:impl="0x7FFF" edc:_addr="0x4000041C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:nzwidth="0x1" edc:desc="SERCOM2 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:nzwidth="0x1" edc:desc="SERCOM3 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:nzwidth="0x1" edc:desc="SERCOM4 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:nzwidth="0x1" edc:desc="TCC0 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:nzwidth="0x1" edc:desc="TCC1 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:nzwidth="0x1" edc:desc="TCC2 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:nzwidth="0x1" edc:desc="TC3 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:nzwidth="0x1" edc:desc="DAC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="AES_" edc:nzwidth="0x1" edc:desc="AES APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:nzwidth="0x1" edc:desc="TRNG APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="APBDMASK" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:por="00000000000000000000000011111111" edc:mclr="00000000000000000000000011111111" edc:impl="0xFF" edc:_addr="0x40000420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:nzwidth="0x1" edc:desc="SERCOM5 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:nzwidth="0x1" edc:desc="TC4 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:nzwidth="0x1" edc:desc="ADC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:nzwidth="0x1" edc:desc="PTC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:nzwidth="0x1" edc:desc="OPAMP APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="APBEMASK" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000001001" edc:mclr="00000000000000000000000000001001" edc:impl="0x1" edc:_addr="0x40000424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3D8" edc:_addr="0x40000428"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="RCAUSE" edc:nzwidth="0x8" edc:access="rrrr-rrr" edc:impl="0xF7" edc:_addr="0x40000800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="POR" edc:nzwidth="0x1" edc:desc="Power On Reset"/>
            <edc:SFRFieldDef edc:cname="BOD12" edc:nzwidth="0x1" edc:desc="Brown Out 12 Detector Reset"/>
            <edc:SFRFieldDef edc:cname="BOD33" edc:nzwidth="0x1" edc:desc="Brown Out 33 Detector Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:nzwidth="0x1" edc:desc="External Reset"/>
            <edc:SFRFieldDef edc:cname="WDT" edc:nzwidth="0x1" edc:desc="Watchdog Reset"/>
            <edc:SFRFieldDef edc:cname="SYST" edc:nzwidth="0x1" edc:desc="System Reset Request"/>
            <edc:SFRFieldDef edc:cname="BACKUP" edc:nzwidth="0x1" edc:desc="Backup Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x40000801"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="BKUPEXIT" edc:nzwidth="0x8" edc:access="-----rrr" edc:impl="0x7" edc:_addr="0x40000802">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="EXTWAKE" edc:nzwidth="0x1" edc:desc="External Wakeup"/>
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="Real Timer Counter Interrupt"/>
            <edc:SFRFieldDef edc:cname="BBPS" edc:nzwidth="0x1" edc:desc="Battery Backup Power Switch"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x40000803"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="WKDBCONF" edc:nzwidth="0x8" edc:access="---nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1F" edc:_addr="0x40000804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="WKDBCNT" edc:nzwidth="0x5" edc:desc="Wakeup Debounce Counter">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No debouncing.Input pin is low or high level sensitive depending on its WKPOLx bit." edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="2CK32" edc:desc="Input pin shall be active for at least two 32kHz clock period." edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="3CK32" edc:desc="Input pin shall be active for at least three 32kHz clock period." edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="32CK32" edc:desc="Input pin shall be active for at least 32 32kHz clock period." edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="512CK32" edc:desc="Input pin shall be active for at least 512 32kHz clock period." edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="4096CK32" edc:desc="Input pin shall be active for at least 4096 32kHz clock period." edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="32768CK32" edc:desc="Input pin shall be active for at least 32768 32kHz clock period." edc:when="(field &amp; 0x1F) == 0x06"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40000805"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="WKPOL" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x40000808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="WKPOL" edc:nzwidth="0x10" edc:desc="Wakeup Polarity"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4000080A"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="WKEN" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x4000080C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="WKEN" edc:nzwidth="0x10" edc:desc="Wakeup Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4000080E"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="WKCAUSE" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x40000810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="WKCAUSE" edc:nzwidth="0x10" edc:desc="Wakeup Cause"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
