Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21a1/edc/ATSAML21J18A.PIC
      <edc:AdjustPoint edc:offset="0x3E0" edc:_addr="0x40001020"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="---------------------nnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x73F" edc:_addr="0x40001400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:nzwidth="0x1" edc:desc="BOD33 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:nzwidth="0x1" edc:desc="BOD33 Detection"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:nzwidth="0x1" edc:desc="BOD33 Synchronization Ready"/>
            <edc:SFRFieldDef edc:cname="BOD12RDY" edc:nzwidth="0x1" edc:desc="BOD12 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD12DET" edc:nzwidth="0x1" edc:desc="BOD12 Detection"/>
            <edc:SFRFieldDef edc:cname="B12SRDY" edc:nzwidth="0x1" edc:desc="BOD12 Synchronization Ready"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator Ready"/>
            <edc:SFRFieldDef edc:cname="APWSRDY" edc:nzwidth="0x1" edc:desc="Automatic Power Switch Ready"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:nzwidth="0x1" edc:desc="VDDCORE Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="---------------------nnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x73F" edc:_addr="0x40001404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:nzwidth="0x1" edc:desc="BOD33 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:nzwidth="0x1" edc:desc="BOD33 Detection"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:nzwidth="0x1" edc:desc="BOD33 Synchronization Ready"/>
            <edc:SFRFieldDef edc:cname="BOD12RDY" edc:nzwidth="0x1" edc:desc="BOD12 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD12DET" edc:nzwidth="0x1" edc:desc="BOD12 Detection"/>
            <edc:SFRFieldDef edc:cname="B12SRDY" edc:nzwidth="0x1" edc:desc="BOD12 Synchronization Ready"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator Ready"/>
            <edc:SFRFieldDef edc:cname="APWSRDY" edc:nzwidth="0x1" edc:desc="Automatic Power Switch Ready"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:nzwidth="0x1" edc:desc="VDDCORE Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="---------------------nnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x73F" edc:_addr="0x40001408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:nzwidth="0x1" edc:desc="BOD33 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:nzwidth="0x1" edc:desc="BOD33 Detection"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:nzwidth="0x1" edc:desc="BOD33 Synchronization Ready"/>
            <edc:SFRFieldDef edc:cname="BOD12RDY" edc:nzwidth="0x1" edc:desc="BOD12 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD12DET" edc:nzwidth="0x1" edc:desc="BOD12 Detection"/>
            <edc:SFRFieldDef edc:cname="B12SRDY" edc:nzwidth="0x1" edc:desc="BOD12 Synchronization Ready"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator Ready"/>
            <edc:SFRFieldDef edc:cname="APWSRDY" edc:nzwidth="0x1" edc:desc="Automatic Power Switch Ready"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:nzwidth="0x1" edc:desc="VDDCORE Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="--------------------rrrr--rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF3F" edc:_addr="0x4000140C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:nzwidth="0x1" edc:desc="BOD33 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:nzwidth="0x1" edc:desc="BOD33 Detection"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:nzwidth="0x1" edc:desc="BOD33 Synchronization Ready"/>
            <edc:SFRFieldDef edc:cname="BOD12RDY" edc:nzwidth="0x1" edc:desc="BOD12 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD12DET" edc:nzwidth="0x1" edc:desc="BOD12 Detection"/>
            <edc:SFRFieldDef edc:cname="B12SRDY" edc:nzwidth="0x1" edc:desc="BOD12 Synchronization Ready"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator Ready"/>
            <edc:SFRFieldDef edc:cname="APWSRDY" edc:nzwidth="0x1" edc:desc="Automatic Power Switch Ready"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:nzwidth="0x1" edc:desc="VDDCORE Ready"/>
            <edc:SFRFieldDef edc:cname="BBPS" edc:nzwidth="0x1" edc:desc="Battery Backup Power Switch"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="BOD33" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnnnnnn-n-nnnnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3FF5FE" edc:_addr="0x40001410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="HYST" edc:nzwidth="0x1" edc:desc="Hysteresis Enable"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x2" edc:desc="Action when Threshold Crossed">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="The BOD33 generates a reset" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="The BOD33 generates an interrupt" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BKUP" edc:desc="The BOD33 puts the device in backup sleep mode if VMON=0" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STDBYCFG" edc:nzwidth="0x1" edc:desc="Configuration in Standby mode"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:SFRFieldDef edc:cname="RUNBKUP" edc:nzwidth="0x1" edc:desc="Configuration in Backup mode"/>
            <edc:SFRFieldDef edc:cname="ACTCFG" edc:nzwidth="0x1" edc:desc="Configuration in Active mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VMON" edc:nzwidth="0x1" edc:desc="Voltage Monitored in active and standby mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PSEL" edc:nzwidth="0x4" edc:desc="Prescaler Select">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide clock by 2" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide clock by 4" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide clock by 8" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide clock by 16" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide clock by 32" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide clock by 64" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide clock by 128" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide clock by 256" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="Divide clock by 512" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide clock by 1024" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="DIV2048" edc:desc="Divide clock by 2048" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="DIV4096" edc:desc="Divide clock by 4096" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="DIV8192" edc:desc="Divide clock by 8192" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="DIV16384" edc:desc="Divide clock by 16384" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="DIV32768" edc:desc="Divide clock by 32768" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="DIV65536" edc:desc="Divide clock by 65536" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL" edc:nzwidth="0x6" edc:desc="Threshold Level for VDD"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BKUPLEVEL" edc:nzwidth="0x6" edc:desc="Threshold Level in backup sleep mode or for VBAT"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="BOD12" edc:nzwidth="0x20" edc:access="----------nnnnnnnnnn---n-nnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF17E" edc:_addr="0x40001414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="HYST" edc:nzwidth="0x1" edc:desc="Hysteresis Enable"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x2" edc:desc="Action when Threshold Crossed">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="The BOD12 generates a reset" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="The BOD12 generates an interrupt" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STDBYCFG" edc:nzwidth="0x1" edc:desc="Configuration in Standby mode"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTCFG" edc:nzwidth="0x1" edc:desc="Configuration in Active mode"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PSEL" edc:nzwidth="0x4" edc:desc="Prescaler Select">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide clock by 2" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide clock by 4" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide clock by 8" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide clock by 16" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide clock by 32" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide clock by 64" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide clock by 128" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide clock by 256" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="Divide clock by 512" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide clock by 1024" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="DIV2048" edc:desc="Divide clock by 2048" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="DIV4096" edc:desc="Divide clock by 4096" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="DIV8192" edc:desc="Divide clock by 8192" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="DIV16384" edc:desc="Divide clock by 16384" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="DIV32768" edc:desc="Divide clock by 32768" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="DIV65536" edc:desc="Divide clock by 65536" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL" edc:nzwidth="0x6" edc:desc="Threshold Level"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
