Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21a1/edc/ATSAML21J18A.PIC
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x42002C10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="swrst"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="enable"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:nzwidth="0x1" edc:desc="CTRLB"/>
            <edc:SFRFieldDef edc:cname="STATUS" edc:nzwidth="0x1" edc:desc="STATUS"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x1" edc:desc="Counter"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x1" edc:desc="Period"/>
            <edc:SFRFieldDef edc:cname="CC0" edc:nzwidth="0x1" edc:desc="Compare Channel 0"/>
            <edc:SFRFieldDef edc:cname="CC1" edc:nzwidth="0x1" edc:desc="Compare Channel 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3EC" edc:_addr="0x42002C14"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x42003000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable DAC Controller"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42003001">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DIFF" edc:nzwidth="0x1" edc:desc="Differential mode enable"/>
            <edc:SFRFieldDef edc:cname="REFSEL" edc:nzwidth="0x2" edc:desc="Reference Selection for DAC0/1">
              <edc:SFRFieldSemantic edc:cname="VREFPU" edc:desc="External reference unbuffered" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VDDANA" edc:desc="Analog supply" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="VREFPB" edc:desc="External reference buffered" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="INTREF" edc:desc="Internal bandgap reference" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x42003002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="STARTEI0" edc:nzwidth="0x1" edc:desc="Start Conversion Event Input DAC 0"/>
            <edc:SFRFieldDef edc:cname="STARTEI1" edc:nzwidth="0x1" edc:desc="Start Conversion Event Input DAC 1"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO0" edc:nzwidth="0x1" edc:desc="Data Buffer Empty Event Output DAC 0"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO1" edc:nzwidth="0x1" edc:desc="Data Buffer Empty Event Output DAC 1"/>
            <edc:SFRFieldDef edc:cname="INVEI0" edc:nzwidth="0x1" edc:desc="Enable Invertion of DAC 0 input event"/>
            <edc:SFRFieldDef edc:cname="INVEI1" edc:nzwidth="0x1" edc:desc="Enable Invertion of DAC 1 input event"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x42003003"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x42003004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Enable for DAC 0"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Enable for DAC 1"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:nzwidth="0x1" edc:desc="Data Buffer 0 Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:nzwidth="0x1" edc:desc="Data Buffer 1 Empty Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x42003005">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Enable for DAC 0"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Enable for DAC 1"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:nzwidth="0x1" edc:desc="Data Buffer 0 Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:nzwidth="0x1" edc:desc="Data Buffer 1 Empty Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x42003006">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:nzwidth="0x1" edc:desc="DAC 0 Underrun"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:nzwidth="0x1" edc:desc="DAC 1 Underrun"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:nzwidth="0x1" edc:desc="Data Buffer 0 Empty"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:nzwidth="0x1" edc:desc="Data Buffer 1 Empty"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="----rrrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x42003007">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="READY0" edc:nzwidth="0x1" edc:desc="DAC 0 Startup Ready"/>
            <edc:SFRFieldDef edc:cname="READY1" edc:nzwidth="0x1" edc:desc="DAC 1 Startup Ready"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="DAC 0 End of Conversion"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="DAC 1 End of Conversion"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
