Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21a1/edc/ATSAML21J18A.PIC
      <edc:SFRDef ltx:memberofperipheral="TC4" edc:cname="CCBUF1" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:addr="0x43000832">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x10" edc:desc="Counter/Compare Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="TC4/COUNT32">
      <edc:SFRDef ltx:memberofperipheral="TC4" edc:cname="COUNT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x43000814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x20" edc:desc="Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC4" edc:cname="CC0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x4300081C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x20" edc:desc="Counter/Compare Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC4" edc:cname="CC1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x43000820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x20" edc:desc="Counter/Compare Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC4" edc:cname="CCBUF0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x43000830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x20" edc:desc="Counter/Compare Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC4" edc:cname="CCBUF1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x43000834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x20" edc:desc="Counter/Compare Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="USB/DEVICE">
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="CTRLB" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:por="0000000000000001" edc:mclr="0000000000000001" edc:impl="0xFFF" edc:addr="0x41000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DETACH" edc:nzwidth="0x1" edc:desc="Detach"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume"/>
            <edc:SFRFieldDef edc:cname="SPDCONF" edc:nzwidth="0x2" edc:desc="Speed Configuration">
              <edc:SFRFieldSemantic edc:cname="FS" edc:desc="FS : Full Speed" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LS" edc:desc="LS : Low Speed" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="HS" edc:desc="HS : High Speed capable" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="HSTM" edc:desc="HSTM: High Speed Test Mode (force high-speed mode for test mode)" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NREPLY" edc:nzwidth="0x1" edc:desc="No Reply"/>
            <edc:SFRFieldDef edc:cname="TSTJ" edc:nzwidth="0x1" edc:desc="Test mode J"/>
            <edc:SFRFieldDef edc:cname="TSTK" edc:nzwidth="0x1" edc:desc="Test mode K"/>
            <edc:SFRFieldDef edc:cname="TSTPCKT" edc:nzwidth="0x1" edc:desc="Test packet mode"/>
            <edc:SFRFieldDef edc:cname="OPMODE2" edc:nzwidth="0x1" edc:desc="Specific Operational Mode"/>
            <edc:SFRFieldDef edc:cname="GNAK" edc:nzwidth="0x1" edc:desc="Global NAK"/>
            <edc:SFRFieldDef edc:cname="LPMHDSK" edc:nzwidth="0x2" edc:desc="Link Power Management Handshake">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No handshake. LPM is not supported" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="ACK" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NYET" edc:desc="NYET" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="STALL" edc:desc="STALL" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="DADD" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:addr="0x4100000A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DADD" edc:nzwidth="0x7" edc:desc="Device Address"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:nzwidth="0x1" edc:desc="Device Address Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
